In [1]:
# Importing necessary libraries
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.cluster import KMeans

In [ ]:
# Load the dataset
retail_df = pd.read_excel('./data/Online_Retail.xlsx')

In [9]:
# Check basic information about the dataset
retail_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 541909 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    541909 non-null  object
 1   StockCode    541909 non-null  object
 2   Description  540455 non-null  object
 3   Quantity     541909 non-null  int64
 4   InvoiceDate  541909 non-null  datetime64[ns]
 5   UnitPrice    541909 non-null  float64
 6   CustomerID   406829 non-null  float64
 7   Country      541909 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(4)
memory usage: 33.1+ MB

In [11]:
# Remove any rows with missing values, negative quantities or prices
retail_df = retail_df[retail_df['Quantity'] > 0] 
retail_df = retail_df[retail_df['UnitPrice'] > 0] 
retail_df = retail_df[retail_df['CustomerID'].notnull()] 

# Convert 'CustomerID' column to integer type
retail_df['CustomerID'] = retail_df['CustomerID'].astype(int)

# Check cleaned dataset information
retail_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 397884 entries, 0 to 541908
Data columns (total 8 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   InvoiceNo    397884 non-null  object
 1   StockCode    397884 non-null  object
 2   Description  397884 non-null  object
 3   Quantity     397884 non-null  int64
 4   InvoiceDate  397884 non-null  datetime64[ns]
 5   UnitPrice    397884 non-null  float64
 6   CustomerID   397884 non-null  int64
 7   Country      397884 non-null  object
dtypes: datetime64[ns](1), float64(1), int64(2), object(4)
memory usage: 27.3+ MB

In [12]:
print(retail_df.isnull().sum())

InvoiceNo      0
StockCode      0
Description    0
Quantity       0
InvoiceDate    0
UnitPrice      0
CustomerID     0
Country        0
dtype: int64

In [21]:
print(retail_df.shape)

(392692, 8)

In [14]:
# Remove any duplicate records
retail_df.drop_duplicates(inplace=True)
print(retail_df.shape) # Print the shape of dataset to confirm duplicates removal

(392692, 8)

In [19]:
# Check the total number of products, transactions and customers
pd.DataFrame([{'Product':retail_df['StockCode'].nunique(),
              'Transaction':retail_df['InvoiceNo'].nunique(),
              'Customer':retail_df['CustomerID'].nunique()}], 
             columns = ['Product', 'Transaction', 'Customer'],
            index = ['counts'])

        Product  Transaction  Customer
counts     3665        18532      4338

In [15]:
retail_df['Country'].value_counts()

United Kingdom          349203
Germany                   9025
France                    8326
EIRE                      7226
Spain                     2479
Netherlands               2359
Belgium                   2031
Switzerland               1841
Portugal                  1453
Australia                 1181
Norway                    1071
Italy                      758
Channel Islands            747
Finland                    685
Cyprus                     603
Sweden                     450
Austria                    398
Denmark                    380
Poland                     330
Japan                      321
Israel                     245
Unspecified                241
Singapore                  222
Iceland                    182
USA                        179
Canada                     151
Greece                     145
Malta                      112
United Arab Emirates        68
European Community          60
RSA                         57
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              25
Bahrain                     17
Saudi Arabia                 9
Name: Country, dtype: int64

In [24]:
# Add 'SaleAmount' column
retail_df['SaleAmount'] = retail_df['UnitPrice'] * retail_df['Quantity']
retail_df.head(1)

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,SaleAmount
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.3

In [26]:
# Create a new dataframe with each customer's frequency, total sales amount, and recency of purchase
aggregations = {    
    'InvoiceNo':'count',
    'SaleAmount':'sum',
    'InvoiceDate':'max'
}
customer_df = retail_df.groupby('CustomerID').agg(aggregations)
customer_df

            InvoiceNo  SaleAmount         InvoiceDate
CustomerID
12346               1    77183.60 2011-01-18 10:01:00
12347             182     4310.00 2011-12-07 15:52:00
12348              31     1797.24 2011-09-25 13:13:00
12349              73     1757.55 2011-11-21 09:51:00
12350              17      334.40 2011-02-02 16:01:00
...               ...         ...                 ...
18280              10      180.60 2011-03-07 09:52:00
18281               7       80.82 2011-06-12 10:53:00
18282              12      178.05 2011-12-02 11:43:00
18283             721     2045.53 2011-12-06 12:02:00
18287              70     1837.28 2011-10-28 09:29:00

[4338 rows x 3 columns]

In [27]:
customer_df = customer_df.reset_index()
customer_df

      CustomerID  InvoiceNo  SaleAmount         InvoiceDate
0          12346          1    77183.60 2011-01-18 10:01:00
1          12347        182     4310.00 2011-12-07 15:52:00
2          12348         31     1797.24 2011-09-25 13:13:00
3          12349         73     1757.55 2011-11-21 09:51:00
4          12350         17      334.40 2011-02-02 16:01:00
...          ...        ...         ...                 ...
4333       18280         10      180.60 2011-03-07 09:52:00
4334       18281          7       80.82 2011-06-12 10:53:00
4335       18282         12      178.05 2011-12-02 11:43:00
4336       18283        721     2045.53 2011-12-06 12:02:00
4337       18287         70     1837.28 2011-10-28 09:29:00

[4338 rows x 4 columns]